{
  "\n": 29,
  " ": 0,
  "!": 77,
  "#": 100,
  "$": 70,
  "&": 84,
  "'": 102,
  "(": 49,
  ")": 50,
  "*": 96,
  "+": 130,
  ",": 21,
  "-": 54,
  ".": 17,
  "/": 83,
  "0": 45,
  "1": 55,
  "2": 63,
  "3": 68,
  "4": 69,
  "5": 66,
  "6": 73,
  "7": 71,
  "8": 74,
  "9": 72,
  ":": 38,
  ";": 67,
  "?": 44,
  "@": 149,
  "A": 28,
  "B": 41,
  "C": 42,
  "D": 37,
  "E": 30,
  "F": 57,
  "G": 53,
  "H": 40,
  "I": 26,
  "J": 60,
  "K": 65,
  "L": 51,
  "M": 39,
  "N": 36,
  "O": 46,
  "P": 33,
  "Q": 56,
  "R": 34,
  "S": 31,
  "T": 27,
  "U": 52,
  "V": 64,
  "W": 35,
  "X": 76,
  "Y": 47,
  "Z": 75,
  "[": 79,
  "\\": 136,
  "]": 80,
  "_": 134,
  "a": 4,
  "b": 22,
  "c": 14,
  "d": 11,
  "e": 1,
  "f": 20,
  "g": 15,
  "h": 9,
  "i": 6,
  "j": 43,
  "k": 24,
  "l": 10,
  "m": 18,
  "n": 5,
  "o": 3,
  "p": 19,
  "q": 62,
  "r": 7,
  "s": 8,
  "t": 2,
  "u": 12,
  "v": 23,
  "w": 16,
  "x": 48,
  "y": 13,
  "z": 61,
  "|": 125,
  "}": 131,
  "\u00a0": 78,
  "\u00a3": 133,
  "\u00a7": 154,
  "\u00c1": 101,
  "\u00c7": 146,
  "\u00c8": 143,
  "\u00c9": 88,
  "\u00ca": 148,
  "\u00cd": 111,
  "\u00d1": 93,
  "\u00d3": 113,
  "\u00d6": 89,
  "\u00da": 117,
  "\u00dc": 115,
  "\u00e0": 98,
  "\u00e1": 91,
  "\u00e2": 112,
  "\u00e3": 120,
  "\u00e4": 150,
  "\u00e7": 135,
  "\u00e8": 110,
  "\u00e9": 86,
  "\u00ea": 105,
  "\u00ed": 95,
  "\u00ef": 109,
  "\u00f1": 94,
  "\u00f3": 90,
  "\u00f4": 123,
  "\u00f6": 97,
  "\u00fa": 104,
  "\u00fc": 122,
  "\u0107": 157,
  "\u010d": 137,
  "\u0110": 116,
  "\u0112": 121,
  "\u0116": 106,
  "\u0119": 156,
  "\u011e": 99,
  "\u011f": 87,
  "\u0142": 127,
  "\u0144": 126,
  "\u014c": 155,
  "\u014d": 108,
  "\u015a": 152,
  "\u015b": 119,
  "\u015f": 147,
  "\u0160": 103,
  "\u0161": 114,
  "\u016b": 128,
  "\u0219": 151,
  "\u1e25": 142,
  "\u1ea1": 139,
  "\u1ea7": 138,
  "\u1eb6": 124,
  "\u1ebf": 107,
  "\u1ec5": 132,
  "\u1ecc": 144,
  "\u1ecd": 145,
  "\u200e": 153,
  "\u2011": 118,
  "\u2013": 82,
  "\u2014": 32,
  "\u2018": 85,
  "\u2019": 25,
  "\u201c": 58,
  "\u201d": 59,
  "\u2022": 92,
  "\u2026": 81,
  "\u2032": 140,
  "\u2033": 141,
  "\u20ac": 129
}